tutorials/multiRegion/CHT/VoFcoolingCylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamMultiRun;

regionSolvers
{
    fluid           compressibleVoF;
    solid           solid;
}

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           2;

maxAlphaCo      1;

maxDi           200;

maxDeltaT       1;

functions
{
    #includeFunc patchAverage
    (
        name=cylinderT,
        region=fluid,
        patch=fluid_to_solid,
        field=T
    )
    #includeFunc patchAverage
    (
        name=inletU,
        region=fluid,
        patch=inlet,
        field=U
    )
}


// ************************************************************************* //
